print('Перезагрузите компьютер и попробуйте подключиться')
first = input('Исправили проблему? Да/Нет: ')

YES = 'Да'
NO = 'Нет'

if first == YES:
    print('Проблема решена))')
else:
    print('Перезагрузите маршрутизатор и подключитесь')
    second = input('Исправили проблему? Да/Нет: ')
if first == YES:
    print('Проблема решена))')
else:
    print('Убедитесь, что кабели м/у маршрутизатором и модемом прочно соединены')
    second = input('Исправили проблему? Да/Нет: ')
if first == YES:
    print('Проблема решена))')
else:
    print('Переместите маршрутизатор на новое место')
    second = input('Исправили проблему? Да/Нет: ')
if first == YES:
    print('Проблема решена))')
else:
    print('Возьмите новый маршрутизатор')
